openwch/ch583/Application/wristband/firmware/Demo_Firmware/soc/ch57x/CH573SFR.h
/* Special Program Space */
#define DATA_FLASH_ADDR     0x70000                   // start address of Data-Flash
#define DATA_FLASH_SIZE     0x8000                    // size of Data-Flash
#define BOOT_LOAD_ADDR      0x78000                   // start address of boot loader program
#define BOOT_LOAD_SIZE      0x6000                    // size of boot loader program
#define BOOT_LOAD_CFG       0x7E000                   // start address of configuration information for boot loader program
#define ROM_CFG_ADDR        0x7F000                   // chip configuration information address

/*----- Reference Information --------------------------------------------*/
#define ID_CH573            0x73                      // chip ID
#define ID_CH571            0x71                      // chip ID

/* Interrupt routine address and interrupt number */
#define INT_ID_TMR0         16                        // interrupt number for Timer0
#define INT_ID_GPIO_A       17                        // interrupt number for GPIO port A
#define INT_ID_GPIO_B       18                        // interrupt number for GPIO port B
#define INT_ID_SPI0         19                        // interrupt number for SPI0
#define INT_ID_BLEB         20                        // interrupt number for BLEBB
#define INT_ID_BLEL         21                        // interrupt number for BLELLE
#define INT_ID_USB          22                        // interrupt number for USB
#define INT_ID_TMR1         24                        // interrupt number for Timer1
#define INT_ID_TMR2         25                        // interrupt number for Timer2
#define INT_ID_UART0        26                        // interrupt number for UART0
#define INT_ID_UART1        27                        // interrupt number for UART1
#define INT_ID_RTC          28                        // interrupt number for RTC
#define INT_ID_ADC          29                        // interrupt number for ADC and TouchKey
#define INT_ID_PWMX         31                        // interrupt number for PWM4~11
#define INT_ID_TMR3         32                        // interrupt number for Timer3
#define INT_ID_UART2        33                        // interrupt number for UART2
#define INT_ID_UART3        34                        // interrupt number for UART3
#define INT_ID_WDOG_BAT     35                        // interrupt number for Watch-Dog timer and Battery low voltage
#define INT_VEC_ENTRY_SZ    4                         // size of each interrupt vector entry
#define INT_ADDR_TMR0       (INT_ID_TMR0*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer0
#define INT_ADDR_GPIO_A     (INT_ID_GPIO_A*INT_VEC_ENTRY_SZ)  // interrupt vector address for GPIO port A
#define INT_ADDR_GPIO_B     (INT_ID_GPIO_B*INT_VEC_ENTRY_SZ)  // interrupt vector address for GPIO port B
#define INT_ADDR_SPI0       (INT_ID_SPI0*INT_VEC_ENTRY_SZ)    // interrupt vector address for SPI0
#define INT_ADDR_BLEB       (INT_ID_BLEB*INT_VEC_ENTRY_SZ)    // interrupt vector address for BLEBB
#define INT_ADDR_BLEL       (INT_ID_BLEL*INT_VEC_ENTRY_SZ)    // interrupt vector address for BLELLE
#define INT_ADDR_USB        (INT_ID_USB*INT_VEC_ENTRY_SZ)     // interrupt vector address for USB
#define INT_ADDR_TMR1       (INT_ID_TMR1*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer1
#define INT_ADDR_TMR2       (INT_ID_TMR2*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer2
#define INT_ADDR_UART0      (INT_ID_UART0*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART0
#define INT_ADDR_UART1      (INT_ID_UART1*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART1
#define INT_ADDR_RTC        (INT_ID_RTC*INT_VEC_ENTRY_SZ)     // interrupt vector address for RTC
#define INT_ADDR_ADC        (INT_ID_ADC*INT_VEC_ENTRY_SZ)     // interrupt vector address for ADC and TouchKey
#define INT_ADDR_PWMX       (INT_ID_PWMX*INT_VEC_ENTRY_SZ)    // interrupt vector address for PWM4~11
#define INT_ADDR_TMR3       (INT_ID_TMR3*INT_VEC_ENTRY_SZ)    // interrupt vector address for Timer3
#define INT_ADDR_UART2      (INT_ID_UART2*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART2
#define INT_ADDR_UART3      (INT_ID_UART3*INT_VEC_ENTRY_SZ)   // interrupt vector address for UART3
#define INT_ADDR_WDOG_BAT   (INT_ID_WDOG_BAT*INT_VEC_ENTRY_SZ) // interrupt vector address for Watch-Dog timer and Battery low voltage

#ifndef TABLE_IRQN
#define __PFIC_PRIO_BITS          2 /*!< uses 8 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used */
typedef enum IRQn
{
  Reset_IRQn                    = 1,
  NMI_IRQn                      = 2,      /*!<  Non Maskable Interrupt   */
  EXC_IRQn                      = 3,      /*!<  Exceptions Interrupt     */
  SysTick_IRQn                  = 12,	  /*!<  System timer Interrupt  */
  SWI_IRQn                      = 14,     /*!<  software Interrupt */
  TMR0_IRQn                     = 16,
  GPIO_A_IRQn                   = 17,
  GPIO_B_IRQn                   = 18,
  SPI0_IRQn                     = 19,
  BLEB_IRQn                     = 20,
  BLEL_IRQn                     = 21,
  USB_IRQn                      = 22,
  TMR1_IRQn                     = 24,
  TMR2_IRQn                     = 25,
  UART0_IRQn                    = 26,
  UART1_IRQn                    = 27,
  RTC_IRQn                      = 28,
  ADC_IRQn                      = 29,
  PWMX_IRQn                     = 31,
  TMR3_IRQn                     = 32,
  UART2_IRQn                    = 33,
  UART3_IRQn                    = 34,
  WDOG_BAT_IRQn                 = 35
} IRQn_Type;
#endif


#ifdef __cplusplus
}
#endif

#endif  // __CH573SFR_H__


#ifndef __CH573USBSFR_H__
#define __CH573USBSFR_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* usb addresses         
//      USB:     +8000H - 83FFH                                                    */
#define USB_BASE_ADDR              (0x40008000)

/*       USB  */
#define R32_USB_CONTROL     (*((PUINT32V)0x40008000)) // USB control & interrupt enable & device address
#define R8_USB_CTRL         (*((PUINT8V)0x40008000))  // USB base control
#define  RB_UC_HOST_MODE    0x80      // enable USB host mode: 0=device mode, 1=host mode
#define  RB_UC_LOW_SPEED    0x40      // enable USB low speed: 0=12Mbps, 1=1.5Mbps
#define  RB_UC_DEV_PU_EN    0x20      // USB device enable and internal pullup resistance enable
#define  RB_UC_SYS_CTRL1    0x20      // USB system control high bit
#define  RB_UC_SYS_CTRL0    0x10      // USB system control low bit
#define  MASK_UC_SYS_CTRL   0x30      // bit mask of USB system control
// bUC_HOST_MODE & bUC_SYS_CTRL1 & bUC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need RB_PIN_USB_DP_PU=1 or need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force UDP/UDM output SE0 state
//   1 10: enable USB host and force UDP/UDM output J state
//   1 11: enable USB host and force UDP/UDM output resume or K state
#define  RB_UC_INT_BUSY     0x08      // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define  RB_UC_RESET_SIE    0x04      // force reset USB SIE, need software clear
#define  RB_UC_CLR_ALL      0x02      // force clear FIFO and count of USB
#define  RB_UC_DMA_EN       0x01      // DMA enable and DMA interrupt enable for USB

#define R8_UDEV_CTRL        (*((PUINT8V)0x40008001))  // USB device physical prot control
#define  RB_UD_PD_DIS       0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define  RB_UD_DP_PIN       0x20      // ReadOnly: indicate current UDP pin level
#define  RB_UD_DM_PIN       0x10      // ReadOnly: indicate current UDM pin level
#define  RB_UD_LOW_SPEED    0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define  RB_UD_GP_BIT       0x02      // general purpose bit
#define  RB_UD_PORT_EN      0x01      // enable USB physical port I/O: 0=disable, 1=enable

#define R8_UHOST_CTRL       R8_UDEV_CTRL              // USB host physical prot control
#define  RB_UH_PD_DIS       0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define  RB_UH_DP_PIN       0x20      // ReadOnly: indicate current UDP pin level
#define  RB_UH_DM_PIN       0x10      // ReadOnly: indicate current UDM pin level
#define  RB_UH_LOW_SPEED    0x04      // enable USB port low speed: 0=full speed, 1=low speed
#define  RB_UH_BUS_RESET    0x02      // control USB bus reset: 0=normal, 1=force bus reset
#define  RB_UH_PORT_EN      0x01      // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached

#define R8_USB_INT_EN       (*((PUINT8V)0x40008002))  // USB interrupt enable
#define  RB_UIE_DEV_SOF     0x80      // enable interrupt for SOF received for USB device mode
#define  RB_UIE_DEV_NAK     0x40      // enable interrupt for NAK responded for USB device mode
#define  RB_UIE_FIFO_OV     0x10      // enable interrupt for FIFO overflow
#define  RB_UIE_HST_SOF     0x08      // enable interrupt for host SOF timer action for USB host mode
#define  RB_UIE_SUSPEND     0x04      // enable interrupt for USB suspend or resume event
#define  RB_UIE_TRANSFER    0x02      // enable interrupt for USB transfer completion
#define  RB_UIE_DETECT      0x01      // enable interrupt for USB device detected event for USB host mode
#define  RB_UIE_BUS_RST     0x01      // enable interrupt for USB bus reset event for USB device mode

#define R8_USB_DEV_AD       (*((PUINT8V)0x40008003))  // USB device address
#define  RB_UDA_GP_BIT      0x80      // general purpose bit
#define  MASK_USB_ADDR      0x7F      // bit mask for USB device address

